app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "release_date", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Teste 1"], ["release_date", "2023-12-12"], ["artist_id", 1], ["created_at", "2023-11-16 23:59:51.665076"], ["updated_at", "2023-11-16 23:59:51.665076"]]
---
  def create
    @album = Album.new(album_params)

    if @album.save

UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Teste 2"], ["updated_at", "2023-11-17 01:37:34.784926"], ["id", 22]]
---
  def update
    if @album.update(album_params)

DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 22]]
---
  def destroy
    @album.destroy!