app/controllers/albums_controller.rb

  def coming_soon
    @albums = Album.where(release_date: Date.tomorrow..1.week.from_now)
---
SELECT "albums".* FROM "albums" WHERE "albums"."release_date" BETWEEN $1 AND $2  [["release_date", "2023-11-21"], ["release_date", "2023-11-27"]]