app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    if @artist.save
---
INSERT INTO "artists" ("nickname", "full_name", "birthday", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @artist.update(artist_params)
---
UPDATE "artists" SET "birthday" = $1, "updated_at" = $2 WHERE "artists"."id" = $3  [["birthday", "2001-01-01"], ["updated_at", "2023-11-17 01:36:58.992743"], ["id", 23]]

  def destroy
    @artist.destroy!
---
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 22]]

  def newest
    @artists =
      Artist.where(created_at: Date.today.ago(1.week)..Date.tomorrow).order(id: :desc)
---
SELECT "artists".* FROM "artists" WHERE "artists"."created_at" BETWEEN $1 AND $2 ORDER BY "artists"."id" DESC  [["created_at", "2023-11-13 00:00:00"], ["created_at", "2023-11-21"]]