app/controllers/musics_controller.rb

SELECT "musics".* FROM "musics"
---
  def index
    @musics = Music.all

INSERT INTO "musics" ("album_id", "title", "feat", "release_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["album_id", 1], ["title", "Music 1"], ["feat", "{JohnExample}"], ["release_date", "2023-11-21"], ["created_at", "2023-11-20 13:54:52.365798"], ["updated_at", "2023-11-20 13:54:52.365798"]]
---
  def create
    @music = Music.new(music_params)

    if @music.save

UPDATE "musics" SET "feat" = $1, "updated_at" = $2 WHERE "musics"."id" = $3  [["feat", "{JohnExample2}"], ["updated_at", "2023-11-17 01:35:44.541993"], ["id", 5]]
---
  def update
    if @music.update(music_params)

DELETE FROM "musics" WHERE "musics"."id" = $1  [["id", 4]]
---
  def destroy
    @music.destroy!

SELECT "musics".* FROM "musics" WHERE "musics"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_music
    @music = Music.find(params[:id])